// Създайте програма, която приема естествено число N и след това чете неопределен брой цели 
// положителни числа от стандартния вход. Въвеждането се прекратява при прочитане на числото -1. 
// Да се отпечата сборът на всички числа от въведените, които са взаимно прости с N.
// Вход: 42, 2 5 5 6 3 7 14 11 13 -1,  Изход: 34,  Обяснение: 5 + 5 + 11 + 13 = 34
// Вход: 16, 2 4 6 8 10 11 12 3 -1,  Изход: 14,  Обяснение: 11 + 3 = 14

#include <iostream>

using namespace std;

int main() {
    int N;
    cin >> N;

    int sum = 0;
    int number;
    cin >> number;

    while (number != -1) {
        int a = N, b = number;
        while (b != 0) {
            int temp = b;
            b = a % b;
            a = temp;
        }
        if (a == 1) {
            sum += number;
        }

        cin >> number;
    }

    cout << sum << endl;

    return 0;
}