// Потребител въвежда променлива n. Да се изведе сумата на цифрите на n. 
// Ако сумата не е едноцифрено число продължаваме да намираме сумата, докато резултатът не стане едноцифрено число.
// Вход: 123,  Изход: 6
// Вход: 999999999999,  Изход: 9
// Обяснение: Сумата на цифрите на 999999999999 е 108, а сумата на цифрите на 108 е 9.

#include <iostream>

using namespace std;

int main() {
    long long n;
    cin >> n;

    if (n < 0) n = -n;

    while (n >= 10) {
        long long sum = 0;
        while (n > 0) {
            sum += n % 10;
            n /= 10;
        }
        n = sum;
    }

    cout << n << endl;

    return 0;
}