// Напишете програма, която приема цяло положително число и:
//   - Ако то е едноциферно - да се изпечати.
//   - Ако то е двуцифрено - да се изпечати последната му цифра събрана с 1.
//   - Във всеки друг случай - да се изпечати цялото без последната цифра.
// Вход: 2358,  Изход: 235
// Вход: 92,  Изход: 3
// Вход: 7,  Изход: 7

#include <iostream>

using namespace std;

int main() {
    int n;
    cin >> n;

    (n < 10) && (cout << n << endl)
        || (n >= 10 && n < 100) && (cout << (n % 10 + 1) << endl)
        || (n >= 100) && (cout << n / 10 << endl);

    return 0;
}