// На конзолата се въвежда цяло число. Проверете дали числото е положително. 
// В случай, че е положително - да се отпечата 1, ако е четно, и 0, ако е нечетно. 
// В случай, че е отрицателно - да се отпечата 1, ако числото е по-малко от -5, и 0 в противен случай.
// Вход: 2,  Изход: 1
// Вход: 7,  Изход: 0
// Вход: -10,  Изход: 1
// Вход: -4,  Изход: 0

#include <iostream>

using namespace std;

int main() {
    int n;
    cin >> n;

    if (n > 0) {
        cout << (n % 2 == 0) << endl;
    } else {
        cout << (n < -5) << endl;
    }

    return 0;
}